'''
0. 정의
계단수 - 인접한 자리수의 차이가 1인 것
ex ) 1234323

1. 해결방법
1-1.경험적으로
N = 1 => 9
1 2 3 4 5 6 7 8 9 

N = 2 => 2*9 - 1 # a=9=>1
10 12 21 23 32 34 43 45... (a)(a-1) (a)(a+1)

N = 3 => 4*9 - (1 + 2 + 1) # a=1=>1 a=8=>1 a=9=>2
101 121 123 210 212 232 234 321 323 343 345
(a)(a-1)(a-2) 
(a)(a-1)(a) 
(a)(a+1)(a) 
(a)(a+1)(a+2)

N = 4 => 8*9 - (1 + 2 + 2 + 2 + 1) #a=1=>2 a=2=>1 a=7=>2 a=8=>2 a=9=>1
(a)(a-1)(a-2)(a-3) (a)(a-1)(a-2)(a-1) 
(a)(a-1)(a)(a-1) (a)(a-1)(a)(a+1) 
(a)(a+1)(a)(a-1) (a)(a+1)(a)(a+1) 
(a)(a+1)(a+2)(a+1) (a)(a+1)(a+2)(a+3)

2**(n-1)*9 - (2**(n-2))
'''
DP = [[0 for j in range(10)] for i in range(101)]
mod = 1000000000
ret = 0

n = int(input())

for j in range(10):
	DP[1][j] = 1

for i in range(2, n+1):
	for j in range(10):
		if j==0:
			DP[i][j] = DP[i-1][1] % mod
		elif j==9:
			DP[i][j] = DP[i-1][8] % mod
		else:
			DP[i][j] = (DP[i-1][j-1] + DP[i-1][j+1] )  % mod


for j in range(1,10):
	ret = (ret + DP[n][j]) % mod

print(ret)











